about = ['Имя Фамилия', 'Звание: ', 'Год рождения: ', 'Дата смерти: ', 'История героя: ']
heroes_list = [['Александр Матросов', 'Стрелок-автоматчик 2-го отдельного батальона 91-й отдельной Сибирской добровольческой бригады имениСталина.', 1924, 1943, ['Саша Матросов родителей не знал. Он воспитывался в детском доме и трудовой колонии. Когда началась война,',
'                ему не было и 20. Матросова призвали в армию в сентябре 1942-го и отправили в пехотное училище, а затем',
'                на фронт.В феврале 1943 года его батальон атаковал опорный пункт фашистов, но угодил в ловушку, попав под плотный',
'                огонь, отрезавший путь к окопам. Стреляли из трех дзотов. Два вскоре замолчали, однако третий продолжал',
'                расстреливать красноармейцев, залегших в снегу. Видя, что единственный шанс выйти из-под огня, это подавить огонь соперника, Матросов с однополчанином',
'                дополз до дзота и бросил в его сторону два гранаты. Пулемет замолчал. Красноармейцы пошли в атаку, но',
'                смертельное оружие застрекотало опять. Напарника Александра убило, и Матросов остался перед дзотом один.',
'                Нужно было что-то делать. На принятие решения у него не было и нескольких секунд. Не желая подводить боевых товарищей, Александр своим',
'                телом закрыл амбразуру дзота. Атака увенчалась успехом. А Матросов посмертно получил звание Героя Советского Союза.'],
        {photo:'motrosov.jpg'}],
    ['Николай Гастелло',
    'Военный летчик, командир 2-й эскадрильи 207-го дальнебомбардировочного авиационного полка, капитан.',
    1907,1941, ['Работал слесарем, затем в 1932 году был призван на службу в Красную Армию. Попал в авиаполк, где стал летчиком.',
    'Николай Гастелло участвовал в трех войнах. За год до Великой Отечественной он получил звание капитана. ',
    '26 июня 1941 года экипаж под командованием капитана Гастелло вылетел для удара по немецкой механизированной колонне. ',
    'Дело было на дороге между белорусскими городами Молодечно и Радошковичи. Но колонна хорошо охранялась вражеской артиллерией. ',
    'Завязался бой. Самолет Гастелло был подбит из зенитки. Снаряд повредил топливный бак, машина загорелась. ',
    'Летчик мог катапультироваться, но он решил исполнить воинский долг до конца. ',
    'Николай Гастелло направил горящую машину прямо на колонну врага. Это был первый огненный таран в Великой Отечественной войне. ',
    'Фамилия храброго летчика стала нарицательной. До конца войны всех асов, решившихся пойти на таран, называли гастелловцы. ',
    'Если следовать официальной статистике, то за всю войну было совершено почти шестьсот таранов соперника.'],
        {photo:'gastello.jpg'}],
    ['Зина Портнова', 'Пионер. Разведчица партизанского отряда имени Ворошилова на оккупированной фашистами территории.', 1926, 1944,
    ['Зина родилась и ходила в школу в Ленинграде. Однако война застала ее на территории Белоруссии, куда она приехала на каникулы.',
    'В 1942 году 16-летняя Зина вступила в подпольную организацию «Юные мстители». ',
    'Она распространяла на оккупированных территориях антифашистские листовки. ',
    'Затем под прикрытием устроилась работать в столовую для немецких офицеров, где совершила несколько диверсий и лишь ',
    'чудом не была схвачена врагом. Ее мужеству удивлялись многие опытные военные. В 1943 году Зина Портнова ушла в партизаны ',
    'и продолжила заниматься диверсиями в тылу врага. Из-за усилий перебежчиков, сдавших Зину фашистам, попала в плен. В застенках ',
    'ее допрашивали и пытали. Но Зина молчала, не выдавая своих. На одном из таких допросов она схватила со стола пистолет ',
    'и застрелила троих гитлеровцев. После этого ее расстреляли в тюрьме.'],
        {photo:'portnova.jpg'}],
    ['Алексей Маресьев','Летчик.', 1916, 2001, ['В детстве будущий герой переболел ревматизмом, и доктора сомневались в том,',
    ' что Маресьев сможет летать. Однако он упрямо подавал документы в летное училище, пока наконец не был зачислен.',
    ' В армию Маресьева призвали в 1937 году.Великую Отечественную войну он встретил в летном училище, но вскоре попал на фронт.',
    ' Во время боевого вылета его самолет был подбит, а сам Маресьев смог катапультироваться. Восемнадцать суток, ',
    'тяжело раненный в обе ноги, он выбирался из окружения. Однако он все-таки сумел преодолеть линию фронта и попал в больницу.',
    ' Но уже началась гангрена, и врачи ампутировали ему обе  ноги.Для многих это означало бы конец службы, но летчик не сдался и',
    ' вернулся в авиацию. До конца войны он летал с протезами. За эти годы он совершил 86 боевых вылетов и сбил 11 самолетов противника.',
    ' Причем 7 - уже после ампутации. В 1944 году Алексей Маресьев перешел на работу инспектором и дожил до 84 лет.',
    'Его судьба вдохновила писателя Бориса Полевого написать «Повесть о настоящем человеке».'], {photo: 'maresev.png'}]];

var obj1 = {
    heroes: heroes_list,
    outHeroes:
                function () {
                    function makeTableForHero(hero) {
                        tab = "<table width='90%' class='victory' align='center'><tr>";
                        tab += "<td><img src='images/" + hero[5].photo + "' alt='" + hero[0] + " width='200px' height='200px' </td><td><h1>"+hero[0]+"</h1></td></tr><tr>"
                        tab += "<td width='20%'><p>" + about[1] + "</p></td>"
                        tab += "<td><p>" + hero[1] + "</p></td></tr>"
                        tab += "<td><p>" + about[2] + "</p></td>"
                        tab += "<td><p>" + hero[2] + "</p></td></tr>"
                        tab += "<td><p>" + about[3] + "</p></td>"
                        tab += "<td><p>" + hero[3] + "</p></td></tr>"
                        tab += "<td><p>" + about[4] + "</p></td>"
                        hero_text = hero[4].join(' ')
                        tab += "<td><p>" + hero_text + "</p></td></tr>"
                        tab += "</tr></table>";
                        return tab;
                    };
                    var out = this.heroes.map(makeTableForHero);
                    var elem = document.getElementById('table_victory');
                    out.forEach(function (info, i, arr) {
                        elem.innerHTML += info + "<br>";
                    });
                }
}

function Change() {
    this.heroes = Object.assign([], heroes_list);
    this.changeHeroes = function (data) {
        this.heroes = this.heroes.sort(function (a,b) {
            return data == 1 ? a[2]-b[2] : b[2]-a[2]
        });
    }
}

(function (window, document) {
    window.onload = init;

    function init() {
        var obj2 = new Change();
        obj1.outHeroes();   //пункт 3.a
        obj1.outHeroes.call(obj2);  //пункт 3.б
        obj2.changeHeroes.call(obj1,1);  //пункт 3.в
        obj1.outHeroes();  //пункт 3.г
        console.log(obj2); //Данные obj2 не зависят от obj1
    }
})(window, document);
